[
  {
    "id": 1,
    "title": "ادھورے خط",
    "slug": "adhooray-khat",
    "level": "advanced",
    "sentences": [
      {
        "urdu": "کتنے ہی خط درازوں میں ایسے پڑے ہیں، جن پر نہ مکمل پتے ہیں، نہ مکمل جذبات۔",
        "english": "So many letters lie in drawers, bearing neither complete addresses nor complete emotions."
      },
      {
        "urdu": "کبھی کوئی لفظ لکھتے ہوئے رُک گئے، کبھی جذبات کا بوجھ قلم سے نہ اٹھ سکا۔",
        "english": "Sometimes the hand halted mid-word, sometimes the weight of emotions was too much for the pen to bear."
      },
      {
        "urdu": "کاغذ پر بہتے ہوئے سیاہی کے دھبے، جیسے آنکھوں سے گرنے والے آنسوؤں کے نشان ہوں۔",
        "english": "Ink stains spread on the paper like traces of tears falling from the eyes."
      },
      {
        "urdu": "لفافے بند ہوئے بغیر، مہینوں میز پر رکھے رہے، جیسے ماضی کے دروازے کبھی کھلنے کا انتظار کر رہے ہوں۔",
        "english": "Unsealed envelopes sat on the desk for months, as if doors of the past were waiting to open someday."
      },
      {
        "urdu": "محبتیں جو کبھی کہی نہ گئیں، شکوے جو کبھی سنے نہ گئے — وہ سب انہی کاغذوں میں دفن ہو چکے ہیں۔",
        "english": "Loves never confessed, complaints never heard — all now buried within those sheets."
      },
      {
        "urdu": "خطوں کے لفظوں میں وہ خامشی بولتی ہے، جو آواز میں کبھی بیان نہ ہو سکی۔",
        "english": "Within the words of those letters speaks the silence that could never be voiced."
      },
      {
        "urdu": "کچھ خط ایسے بھی تھے جو صرف موسموں کو مخاطب کرتے، مگر اصل مخاطب کوئی خاص چہرہ ہوتا۔",
        "english": "Some letters seemed to address the seasons, yet deep inside, they spoke to a certain face."
      },
      {
        "urdu": "کبھی بہار کا ذکر کرتے ہوئے خزاں کا درد چھپا ہوتا، کبھی چائے کی خوشبو میں جدائی کی پرچھائیاں۔",
        "english": "Sometimes a mention of spring hid the ache of autumn, sometimes the scent of tea carried shadows of separation."
      },
      {
        "urdu": "ہر سطر ایک احساس تھا، ہر وقفہ ایک سانس کی طرح تھما ہوا۔",
        "english": "Every line was a feeling, every pause suspended like a breath held back."
      },
      {
        "urdu": "وقت گزر گیا، مگر ان ادھورے خطوں نے جذبات کو وقت سے آزاد کر دیا، ایک ایسی قید میں، جہاں لفظ مر نہیں سکتے۔",
        "english": "Time passed, but those unfinished letters freed emotions from time itself, trapping them where words cannot die."
      },
      {
        "urdu": "کبھی کبھی رات کے پچھلے پہر میں، میں وہ خط نکال کر پڑھتا ہوں، جیسے دل کی پرانی دھڑکنوں کو سننے کی کوشش ہو۔",
        "english": "Sometimes in the late hours of the night, I pull out those letters, as if trying to listen to the heart's old rhythms."
      },
      {
        "urdu": "لفظوں کی گونج سے یادیں جاگتی ہیں، اور بیتے لمحے پھر سے سانس لینے لگتے ہیں۔",
        "english": "Memories awaken with the echo of words, and moments gone begin to breathe again."
      },
      {
        "urdu": "شاید ایک دن کوئی انہیں پڑھے، اور ہر ادھورے جملے میں ایک مکمل کہانی تلاش کرے۔",
        "english": "Maybe someday, someone will read them and find a complete story within every unfinished sentence."
      },
      {
        "urdu": "اور شاید اُسی دن، میرے خاموش خط بھی بول پڑیں گے۔",
        "english": "And maybe on that day, my silent letters will finally speak."
      }
    ]
  }
]
